---
layout: post
title:  "测试策略实践续之测试自动化与自动化测试"
date:   2017-04-01 24:00:00
categories: jekyll update
---

<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">@import url('https://themes.googleusercontent.com/fonts/css?kit=LPAmb6kfj_X4TUgARUE0ZWKUrljKNSBEPd2YBFK6lIs');.lst-kix_list_1-3>li:before{content:" "}.lst-kix_list_1-4>li:before{content:" "}ul.lst-kix_list_1-0{list-style-type:none}.lst-kix_list_1-7>li:before{content:" "}.lst-kix_list_1-5>li:before{content:" "}.lst-kix_list_1-6>li:before{content:" "}ul.lst-kix_list_1-3{list-style-type:none}.lst-kix_list_1-0>li:before{content:"-  "}ul.lst-kix_list_1-4{list-style-type:none}.lst-kix_list_1-8>li:before{content:" "}ul.lst-kix_list_1-1{list-style-type:none}ul.lst-kix_list_1-2{list-style-type:none}ul.lst-kix_list_1-7{list-style-type:none}.lst-kix_list_1-1>li:before{content:" "}.lst-kix_list_1-2>li:before{content:" "}ul.lst-kix_list_1-8{list-style-type:none}ul.lst-kix_list_1-5{list-style-type:none}ul.lst-kix_list_1-6{list-style-type:none}ol{margin:0;padding:0}table td,table th{padding:0}.c6{color:#000000;font-weight:700;text-decoration:none;vertical-align:baseline;font-size:24pt;font-family:"Avenir";font-style:normal}.c10{color:#000000;font-weight:700;text-decoration:none;vertical-align:baseline;font-size:15pt;font-family:"Avenir";font-style:normal}.c2{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:12pt;font-family:"Avenir";font-style:normal}.c15{margin-left:39pt;padding-top:12pt;padding-left:-4pt;padding-bottom:0pt;line-height:1.0;text-align:justify}.c11{margin-left:39pt;padding-top:0pt;padding-left:-4pt;padding-bottom:12pt;line-height:1.0;text-align:justify}.c13{padding-top:48pt;padding-bottom:12pt;line-height:1.0;page-break-after:avoid;text-align:center}.c12{padding-top:0pt;padding-bottom:56.6pt;line-height:1.0;text-align:right;height:12pt}.c3{color:#000000;text-decoration:none;vertical-align:baseline;font-size:12pt;font-style:normal}.c0{padding-top:0pt;padding-bottom:0pt;line-height:1.0;text-align:justify;height:12pt}.c9{padding-top:30pt;padding-bottom:8pt;line-height:1.0;page-break-after:avoid;text-align:left}.c5{padding-top:0pt;padding-bottom:0pt;line-height:1.0;text-indent:21.6pt;text-align:justify}.c14{padding-top:12pt;padding-bottom:12pt;line-height:1.0;text-align:center}.c7{padding-top:0pt;padding-bottom:0pt;line-height:1.0;text-align:justify}.c4{background-color:#ffffff;max-width:453.3pt;padding:70.8pt 70.8pt 85pt 70.8pt}.c8{padding:0;margin:0}.c16{margin-left:39pt;padding-left:-4pt}.c1{font-weight:400;font-family:"PingFang SC"}.title{padding-top:24pt;color:#000000;font-weight:700;font-size:36pt;padding-bottom:6pt;font-family:"Avenir";line-height:1.0;page-break-after:avoid;text-align:justify}.subtitle{padding-top:18pt;color:#666666;font-size:24pt;padding-bottom:4pt;font-family:"Georgia";line-height:1.0;page-break-after:avoid;font-style:italic;text-align:justify}li{color:#000000;font-size:12pt;font-family:"Avenir"}p{margin:0;color:#000000;font-size:12pt;font-family:"Avenir"}h1{padding-top:0pt;color:#000000;font-weight:700;font-size:32pt;padding-bottom:0pt;font-family:"Avenir";line-height:1.0;page-break-after:avoid;text-align:left}h2{padding-top:0pt;color:#000000;font-weight:700;font-size:24pt;padding-bottom:0pt;font-family:"Avenir";line-height:1.0;page-break-after:avoid;text-align:left}h3{padding-top:0pt;color:#000000;font-weight:700;font-size:18pt;padding-bottom:0pt;font-family:"Avenir";line-height:1.0;page-break-after:avoid;text-align:left}h4{padding-top:0pt;color:#000000;font-weight:700;font-size:15pt;padding-bottom:0pt;font-family:"Avenir";line-height:1.0;page-break-after:avoid;text-align:left}h5{padding-top:0pt;color:#000000;font-weight:700;font-size:12pt;padding-bottom:0pt;font-family:"Avenir";line-height:1.0;page-break-after:avoid;text-align:left}h6{padding-top:0pt;color:#000000;font-size:12pt;padding-bottom:0pt;font-family:"Avenir";line-height:1.0;page-break-after:avoid;font-style:italic;text-align:left}</style></head><body><p class="c7"><span>&rdquo;</span><span class="c1">&#27979;&#35797;&#33258;&#21160;&#21270;</span><span>&rdquo;</span><span class="c1">&#19982;</span><span>&ldquo;</span><span class="c1">&#33258;&#21160;&#21270;&#27979;&#35797;</span><span>&rdquo;</span><span class="c1">&#36890;&#20439;&#30340;&#29702;&#35299;&#19978;&#37117;&#26159;&#19968;&#20010;&#24847;&#24605;&#65292;&#25105;&#24182;&#19981;&#24819;&#21676;&#25991;&#22204;&#23383;&#65292;&#20294;&#26159;&#20026;&#20102;&#35828;&#26126;&#20004;&#31181;&#33258;&#21160;&#21270;&#27979;&#35797;&#31574;&#30053;&#65292;&#25105;&#26242;&#26102;&#29992;&#36825;&#20004;&#20010;&#21517;&#31216;&#26469;&#21306;&#20998;&#23427;&#20204;&#65292;&#23601;&#20687;&#25935;&#25463;&#24320;&#21457;&#20013;&#30340;</span><span>&rdquo;</span><span class="c1">&#20570;&#27491;&#30830;&#30340;&#20107;&#24773;</span><span>&rdquo;</span><span class="c1">&#21644;</span><span>&rdquo;</span><span class="c1">&#27491;&#30830;&#30340;&#20570;&#20107;&#24773;</span><span>&rdquo;</span><span class="c1">&#19968;&#26679;&#29992;&#20110;&#21306;&#20998;&#12290;</span></p><h4 class="c9"><span class="c1">&#31532;&#19968;&#31181;&#65292;&#33258;&#21160;&#21270;&#27979;&#35797;&#31574;&#30053;&#65306;&#27979;&#35797;&#33258;&#21160;&#21270;&#65292;&#20026;&#20102;&#27979;&#35797;&#32780;&#27979;&#35797;&#32780;&#35753;&#27979;&#35797;&#33258;&#21160;&#21270;&#36215;&#26469;</span></h4><p class="c7"><span class="c3 c1">&#36825;&#31181;&#31574;&#30053;&#20027;&#35201;&#26159;&#25351;&#22242;&#38431;&#24050;&#32463;&#25317;&#26377;&#20102;&#33258;&#24049;&#30340;&#21508;&#31181;&#31867;&#22411;&#30340;&#25163;&#21160;&#27979;&#35797;&#65292;&#27604;&#22914;&#35828;&#25163;&#21160;&#39564;&#25910;&#27979;&#35797;&#65292;&#25163;&#21160;&#31471;&#21040;&#31471;&#27979;&#35797;&#65292;&#25163;&#21160;&#25506;&#32034;&#24615;&#27979;&#35797;&#65292;&#25163;&#21160;&#21387;&#21147;&#27979;&#35797;&#65292;&#25163;&#21160;&#23433;&#20840;&#27979;&#35797;&#31561;&#31561;&#12290;&#28982;&#21518;&#24403;&#22242;&#38431;&#24050;&#32463;&#26080;&#27861;&#25215;&#21463;&#25163;&#21160;&#27979;&#35797;&#25152;&#24102;&#26469;&#30340;&#26102;&#38388;&#21644;&#20154;&#21147;&#25104;&#26412;&#30340;&#26102;&#20505;&#65292;&#23601;&#20250;&#24605;&#32771;&#22914;&#20309;&#20943;&#23569;&#26102;&#38388;&#21644;&#20154;&#21147;&#25104;&#26412;&#65292;&#32780;&#33258;&#21160;&#21270;&#36825;&#20123;&#24050;&#26377;&#30340;&#27979;&#35797;&#65292;&#23601;&#33021;&#26377;&#25928;&#30340;&#20943;&#23569;&#25163;&#21160;&#27979;&#35797;&#30340;&#25104;&#26412;&#12290;</span></p><p class="c0"><span class="c1 c3"></span></p><p class="c7"><span class="c1">&#30001;&#20110;&#26102;&#38388;&#35201;&#27714;&#24555;&#20197;&#21450;&#27979;&#35797;&#20154;&#21592;&#30340;&#33021;&#21147;&#19981;&#36275;&#31561;&#65292;&#25152;&#20197;&#36825;&#31181;&#24773;&#20917;&#19979;&#30340;&#30446;&#26631;&#19968;&#33324;&#37117;&#26159;&#24555;&#36895;&#30340;&#23558;&#20197;&#21069;&#30340;&#27979;&#35797;&#33258;&#21160;&#21270;&#36215;&#26469;&#65292;&#20026;&#20102;&#27979;&#35797;&#32780;&#27979;&#35797;&#65292;&#22240;&#27492;&#19968;&#33324;&#30340;&#35299;&#20915;&#26041;&#26696;&#37117;&#26159;&#36873;&#25321;&#19968;&#20123;&#26131;&#29992;&#30340;&#33258;&#21160;&#21270;&#30340;&#27979;&#35797;&#24037;&#20855;&#25110;&#32773;&#33258;&#21160;&#21270;&#27979;&#35797;&#26694;&#26550;&#65292;&#20027;&#35201;&#30340;&#24037;&#20316;&#26159;&#20197;&#37197;&#32622;&#21644;&#25163;&#21160;&#25805;&#20316;&#33258;&#21160;&#21270;&#20026;&#20027;&#65292;&#24182;&#19988;&#32534;&#20889;&#23569;&#37327;&#33050;&#26412;&#65292;&#27604;&#22914;</span><span>Selenium IDE, Browsersync, JMeter</span><span class="c1">&#65292;</span><span>SOAPUI/PostMan</span><span class="c1">&#31561;&#65292;&#26497;&#38480;&#30340;&#24773;&#20917;&#19979;&#21487;&#20197;&#31216;&#20043;&#20026;</span><span>T</span><span>esting as Tool</span><span class="c1">&#12290;</span></p><p class="c5"><span class="c1">&#65288;&#27880;&#65306;&#20351;&#29992;&#24037;&#20855;&#36827;&#34892;&#35843;&#35797;&#19981;&#23646;&#20110;&#27979;&#35797;&#33258;&#21160;&#21270;&#30340;&#33539;&#22260;&#37324;&#38754;&#65289;</span></p><h4 class="c9"><span class="c1">&#31532;&#20108;&#31181;&#65292;&#33258;&#21160;&#27979;&#35797;&#31574;&#30053;&#65306;&#33258;&#21160;&#21270;&#27979;&#35797;&#65292;&#20026;&#20102;&#39640;&#25928;&#21644;&#26377;&#25928;&#30340;&#27979;&#35797;&#32780;&#24314;&#31435;&#33258;&#21160;&#21270;&#27979;&#35797;&#20307;&#31995;&#21644;&#31995;&#32479;</span></h4><p class="c7"><span class="c1">&#36825;&#31181;&#31574;&#30053;&#20027;&#35201;&#26159;&#25351;&#22242;&#38431;&#20805;&#20998;&#35748;&#35782;&#21040;&#33258;&#21160;&#21270;&#27979;&#35797;&#30340;&#20248;&#21183;&#65292;&#24182;&#19988;&#25317;&#26377;&#36275;&#22815;&#30340;&#24847;&#24895;&#20197;&#21450;&#25216;&#26415;&#33021;&#21147;&#30340;&#26102;&#20505;&#65292;</span><span class="c1">&#24895;&#24847;&#25237;&#20837;&#36275;&#22815;&#30340;&#26102;&#38388;&#20197;&#21450;&#20154;&#21147;&#25104;&#65292;&#24182;&#20174;&#25972;&#20307;&#19978;&#24605;&#32771;&#25972;&#20010;&#31995;&#32479;&#30340;&#27979;&#35797;&#31574;&#30053;&#21644;&#27979;&#35797;&#26550;&#26500;&#65292;&#20174;&#32780;&#21487;&#20197;&#23454;&#29616;&#26356;&#20026;&#26377;&#25928;&#30340;&#27979;&#35797;</span><span class="c1">&#12290;&#28982;&#21518;&#23613;&#21487;&#33021;&#30340;&#36873;&#21462;&#21151;&#33021;&#24378;&#22823;&#30340;&#33258;&#21160;&#21270;&#27979;&#35797;&#26694;&#26550;&#25110;&#32773;&#33258;&#24049;&#24320;&#21457;&#36866;&#21512;&#33258;&#24049;&#30340;&#33258;&#21160;&#21270;&#27979;&#35797;&#26694;&#26550;&#65292;&#20197;&#32534;&#20889;&#20195;&#30721;&#30340;&#26041;&#24335;&#26469;&#26500;&#24314;&#33258;&#21160;&#21270;&#27979;&#35797;&#20307;&#31995;&#65292;&#20027;&#35201;&#30340;&#24037;&#20316;&#26159;&#20197;&#32534;&#20889;&#20195;&#30721;&#20026;&#20027;&#65292;&#27604;&#22914;</span><span>Selenium WebDriver</span><span class="c1">&#65292;</span><span>APPIUM</span><span class="c1">&#65292;</span><span>Gatling</span><span class="c1">&#65292;</span><span>Rest-Assured</span><span class="c1">&#31561;&#65292;&#26497;&#38480;&#24773;&#20917;&#19979;&#21487;&#20197;&#31216;&#20043;&#20026;</span><span>Testing as Code</span><span class="c1">&#12290;</span></p><p class="c5"><span class="c1">&#33258;&#21160;&#21270;&#27979;&#35797;&#31574;&#30053;&#22235;&#35937;&#38480;&#65306;</span></p><p class="c14"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 604.36px; height: 515.96px;"><img alt="" src="http://twranman.github.io/assets/AT&TA.resources/image1.png" style="width: 604.36px; height: 515.96px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><h4 class="c9"><span class="c1">&#29616;&#23454;&#20013;&#30340;&#33258;&#21160;&#21270;&#27979;&#35797;&#31574;&#30053;&#65306;&#28151;&#21512;</span></h4><p class="c7"><span class="c1">&#36825;&#37324;&#30340;&#27979;&#35797;&#33258;&#21160;&#21270;&#21644;&#33258;&#21160;&#21270;&#27979;&#35797;&#21482;&#26159;&#29992;&#26469;&#24847;&#21947;&#20102;&#20004;&#31181;&#26497;&#31471;&#30340;&#33258;&#21160;&#21270;&#27979;&#35797;&#31574;&#30053;&#65292;&#19981;&#23384;&#22312;&#35841;&#27604;&#35841;&#26356;&#22909;&#65292;&#21482;&#26159;&#35841;&#27604;&#35841;&#26356;&#36866;&#21512;&#12290;&#32780;&#29616;&#23454;&#20013;&#30340;&#24456;&#22810;&#39033;&#30446;&#20013;&#24448;&#24448;&#37117;&#26159;&#20114;&#30456;&#20132;&#32455;&#30528;&#36827;&#34892;&#20351;&#29992;&#65292;&#21482;&#26159;&#19981;&#21516;&#30340;&#22242;&#38431;&#21644;&#19981;&#21516;&#30340;&#20844;&#21496;&#20043;&#38388;&#30340;&#20351;&#29992;&#30340;&#27604;&#20363;&#19981;&#19968;&#26679;&#65292;&#25216;&#26415;&#33021;&#21147;&#24046;&#30340;&#19968;&#33324;&#27979;&#35797;&#33258;&#21160;&#21270;&#21344;&#30340;&#27604;&#20363;&#22823;&#19968;&#20123;&#65292;&#32780;&#25216;&#26415;&#33021;&#21147;&#24378;&#30340;&#19968;&#33324;&#33258;&#21160;&#21270;&#27979;&#35797;&#21344;&#30340;&#27604;&#20363;&#22823;&#19968;&#20123;&#65306;</span></p><ul class="c8 lst-kix_list_1-0 start"><li class="c15"><span class="c3 c1">&#27604;&#22914;&#19968;&#20010;&#21019;&#26032;&#23567;&#22242;&#38431;&#65292;&#20135;&#21697;&#20063;&#21018;&#21018;&#36215;&#27493;&#65292;&#24320;&#22987;&#30001;&#20110;&#26102;&#38388;&#21644;&#25104;&#26412;&#19978;&#30340;&#38480;&#21046;&#65292;&#21482;&#33021;&#27979;&#35797;&#33258;&#21160;&#21270;&#65292;&#38543;&#30528;&#31995;&#32479;&#22797;&#26434;&#24230;&#30340;&#22686;&#21152;&#20197;&#21450;&#22242;&#38431;&#30340;&#22686;&#22823;&#65292;&#36880;&#27493;&#30340;&#24320;&#22987;&#24605;&#32771;&#22914;&#20309;&#26681;&#25454;&#33258;&#24049;&#31995;&#32479;&#30340;&#29305;&#28857;&#24320;&#21457;&#33258;&#21160;&#21270;&#27979;&#35797;&#31995;&#32479;&#65292;&#28982;&#21518;&#26681;&#25454;&#33258;&#24049;&#30340;&#36164;&#28304;&#24773;&#20917;&#36880;&#27493;&#30340;&#23454;&#29616;&#21508;&#20010;&#23618;&#32423;&#30340;&#33258;&#21160;&#21270;&#27979;&#35797;&#65292;&#20294;&#26159;&#36824;&#26159;&#20197;&#24037;&#20855;&#21644;&#20195;&#30721;&#28151;&#21512;&#30340;&#26041;&#24335;&#20026;&#20027;&#12290;</span></li><li class="c7 c16"><span class="c3 c1">&#27604;&#22914;&#19968;&#20010;&#22823;&#22411;&#30340;&#20256;&#32479;&#36719;&#20214;&#31995;&#32479;&#22242;&#38431;&#65292;&#20135;&#21697;&#24050;&#32463;&#25104;&#29087;&#20102;&#65292;&#25317;&#26377;&#22823;&#37327;&#30340;&#25163;&#21160;&#25110;&#32773;&#24037;&#20855;&#36741;&#21161;&#30340;&#27979;&#35797;&#33258;&#21160;&#21270;&#12290;&#20294;&#26159;&#30001;&#20110;&#20154;&#21147;&#25104;&#26412;&#20197;&#21450;&#27979;&#35797;&#26102;&#38388;&#25104;&#26412;&#30340;&#22686;&#21152;&#65292;&#19981;&#24471;&#19981;&#23558;&#19968;&#37096;&#20998;&#30456;&#23545;&#23481;&#26131;&#36890;&#36807;&#32534;&#30721;&#33021;&#33258;&#21160;&#21270;&#30340;&#29992;&#20363;&#20808;&#33258;&#21160;&#21270;&#36215;&#26469;&#65292;&#28982;&#21518;&#36890;&#36807;&#33258;&#21160;&#21270;&#30340;&#20135;&#20986;&#20877;&#26469;&#24605;&#32771;&#25972;&#20010;&#33258;&#21160;&#21270;&#27979;&#35797;&#31574;&#30053;&#65292;&#26681;&#25454;&#23376;&#31995;&#32479;&#30340;&#37325;&#35201;&#24615;&#20197;&#21450;&#27979;&#35797;&#23618;&#27425;&#30340;&#20248;&#20808;&#32423;&#65292;&#22312;&#26102;&#38388;&#21644;&#20154;&#21147;&#25104;&#26412;&#37117;&#20801;&#35768;&#30340;&#24773;&#20917;&#19979;&#23558;&#20248;&#20808;&#32423;&#39640;&#30340;&#37325;&#35201;&#23376;&#31995;&#32479;&#30340;&#27979;&#35797;&#21521;&#20840;&#20195;&#30721;&#32423;&#21035;&#30340;&#33258;&#21160;&#21270;&#27979;&#35797;&#25512;&#36827;&#12290;</span></li><li class="c11"><span class="c3 c1">&#27604;&#22914;&#19968;&#20010;&#22823;&#22411;&#30340;&#26032;&#22411;&#20114;&#32852;&#32593;&#31995;&#32479;&#22242;&#38431;&#65292;&#30001;&#20110;&#22242;&#38431;&#20013;&#20154;&#21592;&#25216;&#26415;&#33021;&#21147;&#37117;&#21313;&#20998;&#24378;&#65292;&#27979;&#35797;&#31574;&#30053;&#21644;&#27979;&#35797;&#26550;&#26500;&#24847;&#35782;&#20063;&#24456;&#24378;&#65292;&#25152;&#20197;&#32771;&#34385;&#33258;&#21160;&#21270;&#27979;&#35797;&#30340;&#26102;&#20505;&#30452;&#25509;&#39318;&#20808;&#24605;&#32771;&#36873;&#29992;&#20160;&#20040;&#26679;&#30340;&#33258;&#21160;&#21270;&#27979;&#35797;&#26694;&#26550;&#26469;&#32534;&#20889;&#33258;&#21160;&#21270;&#27979;&#35797;&#65292;&#24182;&#26681;&#25454;&#33258;&#24049;&#39033;&#30446;&#30340;&#26550;&#26500;&#36873;&#21462;&#36866;&#21512;&#30340;&#27979;&#35797;&#26694;&#26550;&#65292;&#22914;&#26524;&#27809;&#26377;&#21512;&#36866;&#23601;&#33258;&#24049;&#24320;&#21457;&#12290;&#28982;&#21518;&#23545;&#20110;&#19968;&#20123;&#19981;&#26159;&#24456;&#37325;&#35201;&#30340;&#31995;&#32479;&#25110;&#32773;&#27979;&#35797;&#31867;&#22411;&#36873;&#29992;&#27979;&#35797;&#24037;&#20855;&#36741;&#21161;&#25163;&#21160;&#36827;&#34892;&#27979;&#35797;&#23601;&#21487;&#20197;&#20102;&#12290;</span></li></ul><p class="c7"><span class="c1">&#24403;&#29702;&#35299;&#24182;&#24847;&#35782;&#21040;&#33258;&#21160;&#21270;&#27979;&#35797;&#31574;&#30053;&#26377;&#36825;&#20004;&#31181;&#26497;&#38480;&#20998;&#31867;&#20043;&#21518;&#65292;&#23601;&#38656;&#35201;&#26681;&#25454;&#33258;&#36523;&#39033;&#30446;&#30340;&#23454;&#38469;&#24773;&#20917;&#26377;&#25928;&#30340;&#23450;&#20041;&#25972;&#20010;&#33258;&#21160;&#21270;&#27979;&#35797;&#31574;&#30053;&#65292;&#27604;&#22914;&#21487;&#20197;&#26159;&#20197;&#24037;&#20855;&#20026;&#20027;&#65292;&#20195;&#30721;&#20026;&#36741;&#65307;&#25110;&#32773;&#26159;&#20197;&#20195;&#30721;&#20026;&#20027;&#65292;&#20197;&#24037;&#20855;&#20026;&#21103;&#65307;&#36824;&#26159;&#20351;&#29992;&#20840;&#20195;&#30721;&#12290;&#26080;&#35770;&#36873;&#25321;&#20160;&#20040;&#37117;&#26159;&#20197;&#38477;&#20302;&#25104;&#26412;&#21644;&#22686;&#24378;&#27979;&#35797;&#26377;&#25928;&#24615;&#20026;&#30446;&#26631;&#65292;&#20219;&#20309;&#20197;&#20026;&#20102;&#33258;&#21160;&#21270;&#27979;&#35797;&#32780;&#33258;&#21160;&#21270;&#27979;&#35797;&#65292;&#20026;&#20102;&#28843;&#32768;&#31561;&#20854;&#20182;&#30446;&#30340;&#30340;&#33258;&#21160;&#21270;&#27979;&#35797;&#19968;&#33324;&#37117;&#26159;&#19981;&#20250;&#24471;&#21040;&#20160;&#20040;&#22909;&#30340;&#32467;&#26524;&#30340;&#12290;</span></p><div><p class="c12"><span class="c2"></span></p></div></body></html>